<?php


namespace App\Helpers;

class LatinToCyrillic
{
    public static function convert($text)
    {
        $map = [
            'ya' => 'я', 'yu' => 'ю', 'yo' => 'ё', 'ye' => 'е',
            'ch' => 'ч', 'sh' => 'ш', 'sch' => 'щ', 'ts' => 'ц',

            'a' => 'а', 'b' => 'б', 'd' => 'д', 'e' => 'е', 'f' => 'ф',
            'g' => 'г', 'h' => 'х', 'i' => 'и', 'j' => 'ж', 'k' => 'к',
            'l' => 'л', 'm' => 'м', 'n' => 'н', 'o' => 'о', 'p' => 'п',
            'q' => ['қ', 'к'],'r' => 'р', 's' => 'с', 't' => 'т', 'u' => 'у',
            'v' => 'в', 'x' => 'кс', 'y' => 'й', 'z' => 'з',

            'A' => 'А', 'B' => 'Б', 'D' => 'Д', 'E' => 'Е', 'F' => 'Ф',
            'G' => 'Г', 'H' => 'Х', 'I' => 'И', 'J' => 'Ж', 'K' => 'К',
            'L' => 'Л', 'M' => 'М', 'N' => 'Н', 'O' => 'О', 'P' => 'П',
            'Q' => 'Қ', 'R' => 'Р', 'S' => 'С', 'T' => 'Т', 'U' => 'У',
            'V' => 'В', 'X' => 'Кс', 'Y' => 'Й', 'Z' => 'З',
        ];

        return strtr($text, $map);
    }
}
